balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F13K22.PIC
        <edc:SFRDef edc:access="rrnnn-nn" edc:cname="BAUDCON" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01000-00" edc:name="BAUDCON" edc:nzwidth="0x8" edc:por="01000-00">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="BAUDCTL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BRG16" edc:desc="" edc:mask="0x1" edc:name="BRG16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKTXP" edc:desc="" edc:mask="0x1" edc:name="CKTXP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTRXP" edc:desc="" edc:mask="0x1" edc:name="DTRXP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:desc="" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SCKP" edc:desc="" edc:mask="0x1" edc:name="SCKP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PSTRCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00001" edc:name="PSTRCON" edc:nzwidth="8" edc:por="---00001">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRSYNC" edc:desc="" edc:mask="0x1" edc:name="STRSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnn----" edc:cname="VREFCON0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000100--" edc:name="VREFCON0" edc:nzwidth="8" edc:por="000100--">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="REFCON0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TSRS" edc:desc="" edc:ishidden="true" edc:mask="0x1" edc:name="TSRS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="" edc:ishidden="true" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVR1S0" edc:desc="" edc:mask="0x1" edc:name="FVR1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVR1S1" edc:desc="" edc:mask="0x1" edc:name="FVR1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVR1ST" edc:desc="" edc:mask="0x1" edc:name="FVR1ST" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FVR1EN" edc:desc="" edc:mask="0x1" edc:name="FVR1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nn-n" edc:cname="VREFCON1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-00-0" edc:name="VREFCON1" edc:nzwidth="8" edc:por="000-00-0">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="REFCON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="D1NSS" edc:desc="" edc:mask="0x1" edc:name="D1NSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="D1PSS" edc:desc="" edc:mask="0x3" edc:name="D1PSS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DAC1OE" edc:desc="" edc:mask="0x1" edc:name="DAC1OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1LPS" edc:desc="" edc:mask="0x1" edc:name="D1LPS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1EN" edc:desc="" edc:mask="0x1" edc:name="D1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="D1NSS0" edc:desc="" edc:mask="0x1" edc:name="D1NSS0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="D1PSS0" edc:desc="" edc:mask="0x1" edc:name="D1PSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1PSS1" edc:desc="" edc:mask="0x1" edc:name="D1PSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="VREFCON2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="VREFCON2" edc:nzwidth="8" edc:por="---00000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="REFCON2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DAC1R" edc:desc="" edc:mask="0x1f" edc:name="DAC1R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DAC1R0" edc:desc="" edc:mask="0x1" edc:name="DAC1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R1" edc:desc="" edc:mask="0x1" edc:name="DAC1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R2" edc:desc="" edc:mask="0x1" edc:name="DAC1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R3" edc:desc="" edc:mask="0x1" edc:name="DAC1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAC1R4" edc:desc="" edc:mask="0x1" edc:name="DAC1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP1CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP1CON" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1M" edc:desc="" edc:mask="0xf" edc:name="CCP1M" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="DC1B" edc:desc="" edc:mask="0x3" edc:name="DC1B" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="P1M" edc:desc="" edc:mask="0x3" edc:name="P1M" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1M0" edc:desc="" edc:mask="0x1" edc:name="CCP1M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M1" edc:desc="" edc:mask="0x1" edc:name="CCP1M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M2" edc:desc="" edc:mask="0x1" edc:name="CCP1M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1M3" edc:desc="" edc:mask="0x1" edc:name="CCP1M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC1B0" edc:desc="" edc:mask="0x1" edc:name="DC1B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC1B1" edc:desc="" edc:mask="0x1" edc:name="DC1B1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1M0" edc:desc="" edc:mask="0x1" edc:name="P1M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1M1" edc:desc="" edc:mask="0x1" edc:name="P1M1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
